In [4]:
pip install Pyppeteer

zsh:1: no matches found: nbconvert[webpdf]
Note: you may need to restart the kernel to use updated packages.

<!DOCTYPE html>
<html>
<body>
<div align="center">
<h2>Prepared by Asif Bhat</h2>
    
<h1>Access Databases using Jupyter Notebook</h1>
</div>
</body>
</html>

# Prerequisites

- Install Oracle Database 19c.



- Install MS SQL Server 2019 Express edition.



- Install PostgreSQL



- Install MySQL

### Install SQLAlchemy

<img src= 'SQLAlchemy.PNG'>

### Install ipython-sql

<img src= 'ipython-sql.PNG'>

### Install Pyodbc

<img src = 'pyodbc.PNG'>

### Install PyMySQL

<img src = 'PyMySQL.PNG'>

### Install cx_oracle

<img src = 'cx_oracle.PNG'>

### Install psycopg2

<img src = 'psycopg2.PNG'>

In [1]:
import sqlalchemy
import numpy
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

### Connec to SQL Server Database using sqlalchemy

Sample Database Used 
    - https://www.sqlservertutorial.net/sql-server-sample-database/
        
    - https://www.sqlskills.com/resources/conferences/salesdb2014.zip

In [2]:
engine_mssql = sqlalchemy.create_engine('mssql+pyodbc://localhost/salesdb?driver=SQL Server?Trusted_Connection=yes')

In [3]:
print("connecting with engine " + str(engine_mssql))

connecting with engine Engine(mssql+pyodbc://localhost/salesdb?driver=SQL+Server)

In [4]:
print(engine_mssql.table_names())

['Customers', 'Employees', 'Products', 'Sales']

In [5]:
con_mssql = engine_mssql.connect()

In [6]:
query = "select * from Employees"
df_mssql = pd.read_sql_query(query, con_mssql)
df_mssql

    EmployeeID    FirstName MiddleInitial        LastName
0            1      Abraham             e          Bennet
1            2     Reginald             l  Blotchet-Halls
2            3       Cheryl             a          Carson
3            4       Michel             e        DeFrance
4            5        Innes             e    del Castillo
5            6          Ann             u            Dull
6            7     Marjorie             r           Green
7            8  Morningstar             r          Greene
8            9         Burt             r      Gringlesby
9           10       Sheryl             u          Hunter
10          11        Livia             a          Karsen
11          12     Charlene             o        Locksley
12          13      Stearns             a      MacFeather
13          14      Heather             c        McBadden
14          15      Michael             '         O'Leary
15          16       Sylvia             a        Panteley
16          17       Albert             i          Ringer
17          18         Anne             i          Ringer
18          19      Meander             m           Smith
19          20         Dean             t        Straight
20          21         Dirk             t        Stringer
21          22      Johnson             h           White
22          23        Akiko             o        Yokomoto

### Connec to SQL Server Database using ipython-sql

__To Connect to SQL Server Database using ipython-sql we neeed to first create a odbc connection__

__Steps to create odbc connection__

1) Go to ODBC Data Source Administration.

2) Click on Add and select the __SQL Serer__ and hit Finish.

<img src = 'odbc0.PNG'>

3) Name your ODBC connection (sqldb).

4) Specify SQL Server name and hit finish.

<img src = 'odbc1.PNG'>

5) Use SQL Server authentication to connect to the database (Salesdb in this case).

<img src = 'odbc2.PNG'>

6) Select the database (salesdb) and click next.

<img src = 'odbc3.PNG'>

7) Test Data Source and hit finish.

<img src = 'odbc4.PNG'>

8) sqldb data source will be visible in the list now.

<img src = 'odbc5.PNG'>

In [7]:
%load_ext sql
%sql mssql+pyodbc://dstran:dstran@sqldb

(pyodbc.ProgrammingError) ('42000', "[42000] [Microsoft][ODBC SQL Server Driver][SQL Server]Login failed for user 'dstran'.  Reason: The password of the account has expired. (18487) (SQLDriverConnect); [42000] [Microsoft][ODBC SQL Server Driver][SQL Server]Login failed for user 'dstran'.  Reason: The password of the account has expired. (18487)")
(Background on this error at: http://sqlalche.me/e/13/f405)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [8]:
%%sql

select top 10 * from Employees

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [9]:
%reload_ext sql

In [10]:
%load_ext sql
%sql mssql+pyodbc://abhat:abhat@sqldb1

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<img src = 'sqldb1.PNG'>

In [13]:
%%sql

select top 10 * from Sales.SpecialOffer

 * mssql+pyodbc://abhat:***@sqldb1
   mssql+pyodbc://dstran:***@sqldb
Done.

[(1, 'No Discount', Decimal('0.0000'), 'No Discount', 'No Discount', datetime.datetime(2011, 5, 1, 0, 0), datetime.datetime(2014, 11, 30, 0, 0), 0, None, '0290C4F5-191F-4337-AB6B-0A2DDE03CBF9', datetime.datetime(2011, 4, 1, 0, 0)),
 (2, 'Volume Discount 11 to 14', Decimal('0.0200'), 'Volume Discount', 'Reseller', datetime.datetime(2011, 5, 31, 0, 0), datetime.datetime(2014, 5, 30, 0, 0), 11, 14, 'D7542EE7-15DB-4541-985C-5CC27AEF26D6', datetime.datetime(2011, 5, 1, 0, 0)),
 (3, 'Volume Discount 15 to 24', Decimal('0.0500'), 'Volume Discount', 'Reseller', datetime.datetime(2011, 5, 31, 0, 0), datetime.datetime(2014, 5, 30, 0, 0), 15, 24, '4BDBCC01-8CF7-40A9-B643-40EC5B717491', datetime.datetime(2011, 5, 1, 0, 0)),
 (4, 'Volume Discount 25 to 40', Decimal('0.1000'), 'Volume Discount', 'Reseller', datetime.datetime(2011, 5, 31, 0, 0), datetime.datetime(2014, 5, 30, 0, 0), 25, 40, '504B5E85-8F3F-4EBC-9E1D-C1BC5DEA9AA8', datetime.datetime(2011, 5, 1, 0, 0)),
 (5, 'Volume Discount 41 to 60', Decimal('0.1500'), 'Volume Discount', 'Reseller', datetime.datetime(2011, 5, 31, 0, 0), datetime.datetime(2014, 5, 30, 0, 0), 41, 60, '677E1D9D-944F-4E81-90E8-47EB0A82D48C', datetime.datetime(2011, 5, 1, 0, 0)),
 (6, 'Volume Discount over 60', Decimal('0.2000'), 'Volume Discount', 'Reseller', datetime.datetime(2011, 5, 31, 0, 0), datetime.datetime(2014, 5, 30, 0, 0), 61, None, '8157F569-4E8D-46B6-9347-5D0F726A9439', datetime.datetime(2011, 5, 1, 0, 0)),
 (7, 'Mountain-100 Clearance Sale', Decimal('0.3500'), 'Discontinued Product', 'Reseller', datetime.datetime(2012, 4, 13, 0, 0), datetime.datetime(2012, 5, 29, 0, 0), 0, None, '7DF15BF5-6C05-47E7-80A4-22BD1CE59A72', datetime.datetime(2012, 3, 14, 0, 0)),
 (8, 'Sport Helmet Discount-2002', Decimal('0.1000'), 'Seasonal Discount', 'Reseller', datetime.datetime(2012, 5, 30, 0, 0), datetime.datetime(2012, 6, 29, 0, 0), 0, None, '20C5D2CC-A38F-48F8-AC9A-8F15943E52AE', datetime.datetime(2012, 4, 30, 0, 0)),
 (9, 'Road-650 Overstock', Decimal('0.3000'), 'Excess Inventory', 'Reseller', datetime.datetime(2012, 5, 30, 0, 0), datetime.datetime(2012, 7, 30, 0, 0), 0, None, '0CF8472B-F9E6-4945-9E09-549D7DDE2198', datetime.datetime(2012, 4, 30, 0, 0)),
 (10, 'Mountain Tire Sale', Decimal('0.5000'), 'Excess Inventory', 'Customer', datetime.datetime(2013, 5, 14, 0, 0), datetime.datetime(2013, 7, 29, 0, 0), 0, None, '220444AD-2EF3-4E4C-87E9-3AA6EE39A877', datetime.datetime(2013, 4, 14, 0, 0))]

### Connect to ORACLE Database using sqlalchemy

Sample Database Used - https://www.oracletutorial.com/getting-started/oracle-sample-database/

__This is how my connection looks like in SQL developer :-__

<img src = 'ora_con.PNG'>

In [14]:
engine_ora = sqlalchemy.create_engine('oracle://c##abhat:abhat@localhost:1521/orcl')

In [15]:
print("connecting with engine " + str(engine_ora))

connecting with engine Engine(oracle://c##abhat:***@localhost:1521/orcl)

In [16]:
print(engine_ora.table_names())

['regions', 'countries', 'locations', 'warehouses', 'employees', 'product_categories', 'products', 'customers', 'contacts', 'orders', 'order_items', 'inventories']

In [17]:
con_ORA = engine_ora.connect()

In [18]:
query = "select * from CONTACTS"
df_ora = pd.read_sql_query(query, con_ORA)
df_ora

,contact_id,first_name,last_name,email,phone,customer_id
0,208,Stephaine,Booker,stephaine.booker@tsocorp.com,+39 55 012 4559,208
1,209,Emilie,Parsons,emilie.parsons@timewarner.com,+39 10 012 4363,209
2,210,Jaleesa,Bowen,jaleesa.bowen@cstbrands.com,+66 76 012 4633,210
3,211,Jeannie,Poole,jeannie.poole@aboutmcdonalds.com,+91 80 012 4637,211
4,212,Adrienne,Lang,adrienne.lang@qualcomm.com,+39 2 012 4771,212
...,...,...,...,...,...,...
314,203,Vella,Hancock,vella.hancock@pmi.com,+39 49 012 4375,203
315,204,Retta,Martinez,retta.martinez@riteaid.com,+39 49 012 4377,204
316,205,Annelle,Lawrence,annelle.lawrence@techdata.com,+39 10 012 4379,205
317,206,Sherron,Simon,sherron.simon@ally.com,+39 10 012 4381,206
318,207,Carita,Mcintyre,carita.mcintyre@northwesternmutual.com,+86 10 012 4165,207

### Using cx_oracle

In [54]:
engine_ora1 = sqlalchemy.create_engine('oracle+cx_oracle://c##abhat:abhat@localhost:1521/orcl')

In [55]:
print("connecting with engine " + str(engine_ora1))

connecting with engine Engine(oracle+cx_oracle://c##abhat:***@localhost:1521/orcl)

In [56]:
print(engine_ora1.table_names())

['regions', 'countries', 'locations', 'warehouses', 'employees', 'product_categories', 'products', 'customers', 'contacts', 'orders', 'order_items', 'inventories']

In [57]:
con_ORA1 = engine_ora1.connect()

In [58]:
query = "select * from CONTACTS"
df_ora1 = pd.read_sql_query(query, con_ORA1)
df_ora1

,contact_id,first_name,last_name,email,phone,customer_id
0,208,Stephaine,Booker,stephaine.booker@tsocorp.com,+39 55 012 4559,208
1,209,Emilie,Parsons,emilie.parsons@timewarner.com,+39 10 012 4363,209
2,210,Jaleesa,Bowen,jaleesa.bowen@cstbrands.com,+66 76 012 4633,210
3,211,Jeannie,Poole,jeannie.poole@aboutmcdonalds.com,+91 80 012 4637,211
4,212,Adrienne,Lang,adrienne.lang@qualcomm.com,+39 2 012 4771,212
...,...,...,...,...,...,...
314,203,Vella,Hancock,vella.hancock@pmi.com,+39 49 012 4375,203
315,204,Retta,Martinez,retta.martinez@riteaid.com,+39 49 012 4377,204
316,205,Annelle,Lawrence,annelle.lawrence@techdata.com,+39 10 012 4379,205
317,206,Sherron,Simon,sherron.simon@ally.com,+39 10 012 4381,206
318,207,Carita,Mcintyre,carita.mcintyre@northwesternmutual.com,+86 10 012 4165,207

### Connect to ORACLE Database using ipython-sql

In [19]:
%load_ext sql
%sql "oracle://c##abhat:abhat@localhost:1521/orcl"

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [20]:
%%sql
select * from contacts where rownum < 11

   mssql+pyodbc://abhat:***@sqldb1
   mssql+pyodbc://dstran:***@sqldb
 * oracle://c##abhat:***@localhost:1521/orcl
0 rows affected.

[(208, 'Stephaine', 'Booker', 'stephaine.booker@tsocorp.com', '+39 55 012 4559', 208),
 (209, 'Emilie', 'Parsons', 'emilie.parsons@timewarner.com', '+39 10 012 4363', 209),
 (210, 'Jaleesa', 'Bowen', 'jaleesa.bowen@cstbrands.com', '+66 76 012 4633', 210),
 (211, 'Jeannie', 'Poole', 'jeannie.poole@aboutmcdonalds.com', '+91 80 012 4637', 211),
 (212, 'Adrienne', 'Lang', 'adrienne.lang@qualcomm.com', '+39 2 012 4771', 212),
 (213, 'Jess', 'Nguyen', 'jess.nguyen@searsholdings.com', '+39 2 012 4773', 213),
 (214, 'Tandy', 'House', 'tandy.house@ebay.com', '+39 2 012 4775', 214),
 (215, 'Herman', 'Stokes', 'herman.stokes@capitalone.com', '+39 49 012 4777', 215),
 (216, 'Keesha', 'Lambert', 'keesha.lambert@emc.com', '+39 49 012 4779', 216),
 (217, 'Lauren', 'Williamson', 'lauren.williamson@usaa.com', '+39 49 012 4781', 217)]

### Connect to MySQL Database using sqlalchemy

__This is how my Schema looks like in MySQL Workbench :-__

<img src = 'mysql1.PNG'>

In [21]:
engine_mysql = sqlalchemy.create_engine('mysql+pymysql://root:root@localhost:3306/sakila')

In [22]:
print("connecting with engine " + str(engine_mysql))

connecting with engine Engine(mysql+pymysql://root:***@localhost:3306/sakila)

In [23]:
print(engine_mysql.table_names())

['actor', 'address', 'category', 'city', 'country', 'customer', 'film', 'film_actor', 'film_category', 'film_text', 'inventory', 'language', 'payment', 'rental', 'staff', 'store']

In [24]:
con_mysql = engine_mysql.connect()

In [25]:
query = "select * from category"
df_mysql = pd.read_sql_query(query, con_mysql)
df_mysql

    category_id         name         last_update
0             1       Action 2006-02-15 04:46:27
1             2    Animation 2006-02-15 04:46:27
2             3     Children 2006-02-15 04:46:27
3             4     Classics 2006-02-15 04:46:27
4             5       Comedy 2006-02-15 04:46:27
5             6  Documentary 2006-02-15 04:46:27
6             7        Drama 2006-02-15 04:46:27
7             8       Family 2006-02-15 04:46:27
8             9      Foreign 2006-02-15 04:46:27
9            10        Games 2006-02-15 04:46:27
10           11       Horror 2006-02-15 04:46:27
11           12        Music 2006-02-15 04:46:27
12           13          New 2006-02-15 04:46:27
13           14       Sci-Fi 2006-02-15 04:46:27
14           15       Sports 2006-02-15 04:46:27
15           16       Travel 2006-02-15 04:46:27

### Connect to MySQL Database using ipython-sql

<img src = 'mysql2.PNG'>

In [1]:
%load_ext sql
%sql "mysql+pymysql://root:root@localhost:3306/world"

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])
Could not parse rfc1738 URL from string '"mysql+pymysql://root:root@localhost:3306/world"'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [27]:
%%sql
SELECT * FROM city LIMIT 0,20

   mssql+pyodbc://abhat:***@sqldb1
   mssql+pyodbc://dstran:***@sqldb
 * mysql+pymysql://root:***@localhost:3306/world
   oracle://c##abhat:***@localhost:1521/orcl
20 rows affected.

[(1, 'Kabul', 'AFG', 'Kabol', 1780000),
 (2, 'Qandahar', 'AFG', 'Qandahar', 237500),
 (3, 'Herat', 'AFG', 'Herat', 186800),
 (4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800),
 (5, 'Amsterdam', 'NLD', 'Noord-Holland', 731200),
 (6, 'Rotterdam', 'NLD', 'Zuid-Holland', 593321),
 (7, 'Haag', 'NLD', 'Zuid-Holland', 440900),
 (8, 'Utrecht', 'NLD', 'Utrecht', 234323),
 (9, 'Eindhoven', 'NLD', 'Noord-Brabant', 201843),
 (10, 'Tilburg', 'NLD', 'Noord-Brabant', 193238),
 (11, 'Groningen', 'NLD', 'Groningen', 172701),
 (12, 'Breda', 'NLD', 'Noord-Brabant', 160398),
 (13, 'Apeldoorn', 'NLD', 'Gelderland', 153491),
 (14, 'Nijmegen', 'NLD', 'Gelderland', 152463),
 (15, 'Enschede', 'NLD', 'Overijssel', 149544),
 (16, 'Haarlem', 'NLD', 'Noord-Holland', 148772),
 (17, 'Almere', 'NLD', 'Flevoland', 142465),
 (18, 'Arnhem', 'NLD', 'Gelderland', 138020),
 (19, 'Zaanstad', 'NLD', 'Noord-Holland', 135621),
 (20, 'Â´s-Hertogenbosch', 'NLD', 'Noord-Brabant', 129170)]

### Connect to PostgreSQL Database using sqlalchemy

#### PgAdmin Console

<img src = 'pgAdmin.PNG'>

In [29]:
engine_postgresql = sqlalchemy.create_engine('postgresql://postgres:postgres@localhost:5432/Pagila')

In [30]:
print("connecting with engine " + str(engine_postgresql))

connecting with engine Engine(postgresql://postgres:***@localhost:5432/Pagila)

In [31]:
print(engine_postgresql.table_names())

['actor', 'film', 'payment_p2007_02', 'payment_p2007_03', 'payment_p2007_04', 'payment_p2007_05', 'payment_p2007_06', 'payment_p2007_01', 'address', 'category', 'city', 'country', 'customer', 'film_actor', 'film_category', 'inventory', 'language', 'rental', 'staff', 'store', 'payment']

In [32]:
con_postgresql = engine_postgresql.connect()

In [33]:
query = "select * from category"
df_postgresql = pd.read_sql_query(query, con_postgresql)
df_postgresql

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

### Connect to PostgreSQL Using psycopg2

#### pgAdmin Console

<img src = 'pgAdmin1.PNG'>

In [39]:
engine_postgresql1 = sqlalchemy.create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/NorthWind')

In [40]:
print("connecting with engine " + str(engine_postgresql1))

connecting with engine Engine(postgresql+psycopg2://postgres:***@localhost:5432/NorthWind)

In [41]:
print(engine_postgresql1.table_names())

['us_states', 'customers', 'orders', 'employees', 'shippers', 'products', 'order_details', 'categories', 'suppliers', 'region', 'territories', 'employee_territories', 'customer_demographics', 'customer_customer_demo']

In [42]:
con_postgresql1 = engine_postgresql1.connect()

In [45]:
query = "select * from categories"
df_postgresql1 = pd.read_sql_query(query, con_postgresql1)
df_postgresql1

,category_id,category_name,description,picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",[]
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an...",[]
2,3,Confections,"Desserts, candies, and sweet breads",[]
3,4,Dairy Products,Cheeses,[]
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal",[]
5,6,Meat/Poultry,Prepared meats,[]
6,7,Produce,Dried fruit and bean curd,[]
7,8,Seafood,Seaweed and fish,[]

### Connect to PostgreSQL Database using ipython-sql

In [48]:
%load_ext sql
%sql "postgresql://postgres:postgres@localhost:5432/Pagila"

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [49]:
%%sql
SELECT * FROM category

   mssql+pyodbc://abhat:***@sqldb1
   mssql+pyodbc://dstran:***@sqldb
   mysql+pymysql://root:***@localhost:3306/world
   oracle://c##abhat:***@localhost:1521/orcl
 * postgresql://postgres:***@localhost:5432/Pagila
16 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (3, 'Children', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (4, 'Classics', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (5, 'Comedy', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (7, 'Drama', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (8, 'Family', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (9, 'Foreign', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (10, 'Games', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (11, 'Horror', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (12, 'Music', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (13, 'New', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (14, 'Sci-Fi', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (15, 'Sports', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (16, 'Travel', datetime.datetime(2006, 2, 15, 9, 46, 27))]

In [50]:
%load_ext sql
%sql "postgresql+psycopg2://postgres:postgres@localhost:5432/NorthWind"

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [52]:
%%sql
SELECT category_name , description FROM categories

   mssql+pyodbc://abhat:***@sqldb1
   mssql+pyodbc://dstran:***@sqldb
   mysql+pymysql://root:***@localhost:3306/world
   oracle://c##abhat:***@localhost:1521/orcl
 * postgresql+psycopg2://postgres:***@localhost:5432/NorthWind
   postgresql://postgres:***@localhost:5432/Pagila
8 rows affected.

[('Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 ('Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 ('Confections', 'Desserts, candies, and sweet breads'),
 ('Dairy Products', 'Cheeses'),
 ('Grains/Cereals', 'Breads, crackers, pasta, and cereal'),
 ('Meat/Poultry', 'Prepared meats'),
 ('Produce', 'Dried fruit and bean curd'),
 ('Seafood', 'Seaweed and fish')]

# END